#### Series Data Structure

In [4]:
import pandas as pd

In [5]:
s = pd.Series([67,21,34,86,12,48])

In [6]:
s

0    67
1    21
2    34
3    86
4    12
5    48
dtype: int64

In [7]:
s.dtype

dtype('int64')

In [8]:
type(s)

pandas.core.series.Series

In [9]:
s.size

6

In [10]:
s.shape

(6,)

#### DataFrame

In [12]:
r = pd.Series([1,2,3,4,5])
n = pd.Series(['ajay','rani','priya','kiran','raju'])
m = pd.Series([67.89, 53.78, 82.45, 76.45, 61.89])

In [13]:
df = pd.DataFrame({
    'roll': r,
    'name': n,
    'marks': m
})

In [14]:
df

   roll   name  marks
0     1   ajay  67.89
1     2   rani  53.78
2     3  priya  82.45
3     4  kiran  76.45
4     5   raju  61.89

In [15]:
type(df)

pandas.core.frame.DataFrame

In [16]:
df.dtypes

roll       int64
name      object
marks    float64
dtype: object

In [17]:
df.shape

(5, 3)

In [18]:
df.size

15

##### Working with Datasets

In [21]:
# Location: https://mitu.co.in/dataset
# Download: student.csv
# Save in your current working directory

In [22]:
# How to find the current working folder
import os
os.getcwd()

'/home/mitu/dc-nlp-mar24'

##### Import the data

In [24]:
df = pd.read_csv('student.csv')

In [25]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [26]:
type(df)

pandas.core.frame.DataFrame

In [27]:
df.shape

(10, 5)

In [28]:
df.size

50

In [29]:
df.dtypes

roll       int64
name      object
class     object
marks    float64
age        int64
dtype: object

In [30]:
df.columns

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [31]:
df.head()

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20

In [32]:
df.head(3)

   roll    name class  marks  age
0     1    anil    TE  56.77   22
1     2    amit    TE  59.77   21
2     3  aniket    BE  76.88   19

In [33]:
df.tail()

   roll    name class  marks  age
5     6  ayesha    BE  49.55   20
6     7    amar    BE  65.34   19
7     8   amita    BE  68.33   23
8     9    amol    TE  56.75   20
9    10   anmol    BE  78.66   21

In [34]:
df.tail(3)

   roll   name class  marks  age
7     8  amita    BE  68.33   23
8     9   amol    TE  56.75   20
9    10  anmol    BE  78.66   21

##### Slicing - Index Based

In [36]:
x = df.iloc[3:9, 1:4]

In [37]:
x

      name class  marks
3  ajinkya    TE  69.66
4     asha    TE  63.28
5   ayesha    BE  49.55
6     amar    BE  65.34
7    amita    BE  68.33
8     amol    TE  56.75

In [38]:
df.iloc[:9, 1:4]

      name class  marks
0     anil    TE  56.77
1     amit    TE  59.77
2   aniket    BE  76.88
3  ajinkya    TE  69.66
4     asha    TE  63.28
5   ayesha    BE  49.55
6     amar    BE  65.34
7    amita    BE  68.33
8     amol    TE  56.75

In [39]:
df.iloc[4:, 1:4]

     name class  marks
4    asha    TE  63.28
5  ayesha    BE  49.55
6    amar    BE  65.34
7   amita    BE  68.33
8    amol    TE  56.75
9   anmol    BE  78.66

In [41]:
df.iloc[:5, 1:]

      name class  marks  age
0     anil    TE  56.77   22
1     amit    TE  59.77   21
2   aniket    BE  76.88   19
3  ajinkya    TE  69.66   20
4     asha    TE  63.28   20

In [42]:
df.iloc[4,:]

roll         5
name      asha
class       TE
marks    63.28
age         20
Name: 4, dtype: object

In [43]:
df.iloc[[5,7,8,3], :]

   roll     name class  marks  age
5     6   ayesha    BE  49.55   20
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
3     4  ajinkya    TE  69.66   20

In [44]:
df.iloc[:, [2,1,3]]

  class     name  marks
0    TE     anil  56.77
1    TE     amit  59.77
2    BE   aniket  76.88
3    TE  ajinkya  69.66
4    TE     asha  63.28
5    BE   ayesha  49.55
6    BE     amar  65.34
7    BE    amita  68.33
8    TE     amol  56.75
9    BE    anmol  78.66

In [46]:
df.iloc[:,1]

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

##### Slicing - Label based

In [48]:
df.loc[:,'name']

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [49]:
df.loc[:,['name','marks']]

      name  marks
0     anil  56.77
1     amit  59.77
2   aniket  76.88
3  ajinkya  69.66
4     asha  63.28
5   ayesha  49.55
6     amar  65.34
7    amita  68.33
8     amol  56.75
9    anmol  78.66

In [50]:
df[['name','marks']]

      name  marks
0     anil  56.77
1     amit  59.77
2   aniket  76.88
3  ajinkya  69.66
4     asha  63.28
5   ayesha  49.55
6     amar  65.34
7    amita  68.33
8     amol  56.75
9    anmol  78.66

In [51]:
df.name

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

##### Functions / Methods of dataframe and series

In [53]:
df['marks'].mean()

64.499

In [54]:
df['marks'].min()

49.55

In [55]:
df['marks'].max()

78.66

In [56]:
df['marks'].sum()

644.9899999999999

In [57]:
df['marks'].median()

64.31

In [58]:
df['marks'].count()

10

In [59]:
df.max()

roll         10
name     ayesha
class        TE
marks     78.66
age          23
dtype: object

In [60]:
df.sum()

roll                                                    55
name     anilamitaniketajinkyaashaayeshaamaramitaamolanmol
class                                 TETEBETETEBEBEBETEBE
marks                                               644.99
age                                                    205
dtype: object

In [61]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   roll    10 non-null     int64
 1   name    10 non-null     object
 2   class   10 non-null     object
 3   marks   10 non-null     float64
 4   age     10 non-null     int64
dtypes: float64(1), int64(2), object(2)
memory usage: 528.0+ bytes

In [62]:
df.describe()

           roll      marks        age
count  10.00000  10.000000  10.000000
mean    5.50000  64.499000  20.500000
std     3.02765   9.207179   1.269296
min     1.00000  49.550000  19.000000
25%     3.25000  57.520000  20.000000
50%     5.50000  64.310000  20.000000
75%     7.75000  69.327500  21.000000
max    10.00000  78.660000  23.000000

##### Custom column operations

In [65]:
df['marks'] / 10 + 0.47

0    6.147
1    6.447
2    8.158
3    7.436
4    6.798
5    5.425
6    7.004
7    7.303
8    6.145
9    8.336
Name: marks, dtype: float64

In [66]:
df['cgpa'] = df['marks'] / 10 + 0.47

In [67]:
df

   roll     name class  marks  age   cgpa
0     1     anil    TE  56.77   22  6.147
1     2     amit    TE  59.77   21  6.447
2     3   aniket    BE  76.88   19  8.158
3     4  ajinkya    TE  69.66   20  7.436
4     5     asha    TE  63.28   20  6.798
5     6   ayesha    BE  49.55   20  5.425
6     7     amar    BE  65.34   19  7.004
7     8    amita    BE  68.33   23  7.303
8     9     amol    TE  56.75   20  6.145
9    10    anmol    BE  78.66   21  8.336

In [68]:
df['marks'] = df['marks'] + 0.52

In [69]:
df

   roll     name class  marks  age   cgpa
0     1     anil    TE  57.29   22  6.147
1     2     amit    TE  60.29   21  6.447
2     3   aniket    BE  77.40   19  8.158
3     4  ajinkya    TE  70.18   20  7.436
4     5     asha    TE  63.80   20  6.798
5     6   ayesha    BE  50.07   20  5.425
6     7     amar    BE  65.86   19  7.004
7     8    amita    BE  68.85   23  7.303
8     9     amol    TE  57.27   20  6.145
9    10    anmol    BE  79.18   21  8.336

In [70]:
x = ['M','M','M','M','F','F','M','F','M','M']

In [71]:
df['gender'] = x

In [72]:
df

   roll     name class  marks  age   cgpa gender
0     1     anil    TE  57.29   22  6.147      M
1     2     amit    TE  60.29   21  6.447      M
2     3   aniket    BE  77.40   19  8.158      M
3     4  ajinkya    TE  70.18   20  7.436      M
4     5     asha    TE  63.80   20  6.798      F
5     6   ayesha    BE  50.07   20  5.425      F
6     7     amar    BE  65.86   19  7.004      M
7     8    amita    BE  68.85   23  7.303      F
8     9     amol    TE  57.27   20  6.145      M
9    10    anmol    BE  79.18   21  8.336      M

In [73]:
r = pd.Series([1,2,3,4,5])
n = pd.Series(['ajay','rani','priya','kiran','raju'])
m = pd.Series([67.89, 53.78, 82.45, 76.45, 61.89])
c = pd.Series(['TE','TE','BE','TE','TE'])
a = pd.Series([21,22,22,21,20])

In [74]:
newdf = pd.DataFrame({
    'roll': r,
    'name': n,
    'class': c,
    'marks': m,
    'age': a
})
newdf

   roll   name class  marks  age
0     1   ajay    TE  67.89   21
1     2   rani    TE  53.78   22
2     3  priya    BE  82.45   22
3     4  kiran    TE  76.45   21
4     5   raju    TE  61.89   20

In [75]:
df = pd.read_csv('student.csv')
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [76]:
newdf.columns

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [77]:
df.columns

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [79]:
pd.concat([df,newdf], ignore_index=True)

    roll     name class  marks  age
0      1     anil    TE  56.77   22
1      2     amit    TE  59.77   21
2      3   aniket    BE  76.88   19
3      4  ajinkya    TE  69.66   20
4      5     asha    TE  63.28   20
5      6   ayesha    BE  49.55   20
6      7     amar    BE  65.34   19
7      8    amita    BE  68.33   23
8      9     amol    TE  56.75   20
9     10    anmol    BE  78.66   21
10     1     ajay    TE  67.89   21
11     2     rani    TE  53.78   22
12     3    priya    BE  82.45   22
13     4    kiran    TE  76.45   21
14     5     raju    TE  61.89   20

##### Boolean Filtering

In [81]:
df['marks'] > 60

0    False
1    False
2     True
3     True
4     True
5    False
6     True
7     True
8    False
9     True
Name: marks, dtype: bool

In [82]:
mask = df['marks'] > 60

In [83]:
df[mask]

   roll     name class  marks  age
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
9    10    anmol    BE  78.66   21

In [84]:
df[df['marks'] > 60]

   roll     name class  marks  age
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
9    10    anmol    BE  78.66   21

In [85]:
x = df[(df['marks'] > 60) & (df['class'] == 'BE')]

In [86]:
x

   roll    name class  marks  age
2     3  aniket    BE  76.88   19
6     7    amar    BE  65.34   19
7     8   amita    BE  68.33   23
9    10   anmol    BE  78.66   21

##### Data Export

In [88]:
x

   roll    name class  marks  age
2     3  aniket    BE  76.88   19
6     7    amar    BE  65.34   19
7     8   amita    BE  68.33   23
9    10   anmol    BE  78.66   21

In [89]:
x.to_csv('output.csv', index=False)